$(document).ready(function () {
  $('#idCheck').hide();
  $('#login_button').click(function () {
    //----------------------------------------------
    // 입력한 이이디를 얻어 변수에 저장
    //----------------------------------------------
    var u_email = $("#u_email").val();
    //----------------------------------------------
    // 만약 아이디가 비어 있으면 경고하고, 비우고, 커서 들여놓고 함수중단
    //----------------------------------------------
    if (u_email.split(" ").join("") == "") {
      $('#idCheck').show();
      $("#u_email").val("");
      $("#u_email").focus();
      return;
    }
    //----------------------------------------------
    // 입력한 암호를 얻어 변수에 저장
    //----------------------------------------------
    var u_pwd = $("#u_pwd").val();
    //----------------------------------------------
    // 만약 암호가 비어 있으면 경고하고, 비우고, 커서 들여놓고 함수중단
    //----------------------------------------------
    if (u_pwd.split(" ").join("") == "") {
      $('#idCheck').show();
      $("#u_pwd").val("");
      $("#u_pwd").focus();
      return;
    }

    //----------------------------------------------
    // ajax
    //----------------------------------------------
    $.ajax({
      //----------------------------------------------
      // 서버쪽 호출 URL 주소
      //----------------------------------------------
      url: "/tp_hotel_booking/uc/LoginAction.do"
      //----------------------------------------------
      // form 태그 안의 데이터를 서버로 보내는 방법 지정 설정
      //----------------------------------------------
      , type: "post"
      //----------------------------------------------
      // 서버에 보낼 데이터를 설정
      //----------------------------------------------
      , data: "u_email=" + u_email + "&u_pwd=" + u_pwd
      //,data : {"uid":uid, "pwd":pwd} //JSON 표현방법
      //,data:$("[name=loginForm]").serialize();
      //,data:$("form").filter("[name=loginForm]").serialize();
      //----------------------------------------------
      // 서버가 응답할 페이지 종류, html일 경우 생략 가능
      //----------------------------------------------
      , dataType: "json"
      //----------------------------------------------
      // 서버가 응답을 성공적으로 보냈을 경우 실행할 익명함수 설정
      // 익명함수의 매개변수에는 서버의 응답물이 저장된 JSON 객체가 들어옴.
      //----------------------------------------------
      , success: function (jsonObj) {
        // 매개변수로 들어오는 JSON 객체에서 아이디, 암호 존재 개수를 꺼내어
        //idCnt에 저장
        var idPwdCheck = jsonObj.idPwdCheck;
        // 아이디, 암호 존재 개수가 1이면 성공 메시지 출력하고 메인화면으로 이동
        if (idPwdCheck == 1) {
          // alert("로그인성공");
          location.replace("index.do");
        }
        // 아이디, 암호 존재 개수 문자열이 1이아니면 경고하고 아이디. 암호비우기
        else {
          // alert("로그인 실패");
          $('#idCheck').show();
          $("#u_email").val("");
          $("#u_pwd").val("");
          $("#u_email").focus();
        }
      }
      //--------------------------------
      // 서버와 통신이 실패했을경우 실행할 익명함수 설정
      //--------------------------------
      , error: function () {
        alert("에러발생");
      }
    });
  });
});
